MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX256ZVMD10/mcu.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CDNE register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No operation
#define CADN                          0x00000040      // Clears All DONE Bits
#define Reserved                      0x00000060      // This field is reserved
#define CDNE                          0x00000078      // Clear DONE Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SSRT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No operation
#define SAST                          0x00000040      // Set All START Bits (activates all channels)
#define Reserved                      0x00000060      // This field is reserved
#define SSRT                          0x00000078      // Set START Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CERR register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No operation
#define CAEI                          0x00000040      // Clear All Error Indicators
#define Reserved                      0x00000060      // This field is reserved
#define CERR                          0x00000078      // Clear Error Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CINT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No operation
#define CAIR                          0x00000040      // Clear All Interrupt Requests
#define Reserved                      0x00000060      // This field is reserved
#define CINT                          0x00000078      // Clear Interrupt Request


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_INT register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This read-only field is reserved and always has the value zero
#define INT15                         0x00008000      // Interrupt Request 15
#define INT14                         0x00004000      // Interrupt Request 14
#define INT13                         0x00002000      // Interrupt Request 13
#define INT12                         0x00001000      // Interrupt Request 12
#define INT11                         0x00000800      // Interrupt Request 11
#define INT10                         0x00000400      // Interrupt Request 10
#define INT9                          0x00000200      // Interrupt Request 9
#define INT8                          0x00000100      // Interrupt Request 8
#define INT7                          0x00000080      // Interrupt Request 7
#define INT6                          0x00000040      // Interrupt Request 6
#define INT5                          0x00000020      // Interrupt Request 5
#define INT4                          0x00000010      // Interrupt Request 4
#define INT3                          0x00000008      // Interrupt Request 3
#define INT2                          0x00000004      // Interrupt Request 2
#define INT1                          0x00000002      // Interrupt Request 1
#define INT0                          0x00000001      // Interrupt Request 0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ERR register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This read-only field is reserved and always has the value zero
#define ERR15                         0x00008000      // Error In Channel 15
#define ERR14                         0x00004000      // Error In Channel 14
#define ERR13                         0x00002000      // Error In Channel 13
#define ERR12                         0x00001000      // Error In Channel 12
#define ERR11                         0x00000800      // Error In Channel 11
#define ERR10                         0x00000400      // Error In Channel 10
#define ERR9                          0x00000200      // Error In Channel 9
#define ERR8                          0x00000100      // Error In Channel 8
#define ERR7                          0x00000080      // Error In Channel 7
#define ERR6                          0x00000040      // Error In Channel 6
#define ERR5                          0x00000020      // Error In Channel 5
#define ERR4                          0x00000010      // Error In Channel 4
#define ERR3                          0x00000008      // Error In Channel 3
#define ERR2                          0x00000004      // Error In Channel 2
#define ERR1                          0x00000002      // Error In Channel 1
#define ERR0                          0x00000001      // Error In Channel 0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_HRS register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This read-only field is reserved and always has the value zero
#define HRS15                         0x00008000      // Hardware Request Status Channel 15
#define HRS14                         0x00004000      // Hardware Request Status Channel 14
#define HRS13                         0x00002000      // Hardware Request Status Channel 13
#define HRS12                         0x00001000      // Hardware Request Status Channel 12
#define HRS11                         0x00000800      // Hardware Request Status Channel 11
#define HRS10                         0x00000400      // Hardware Request Status Channel 10
#define HRS9                          0x00000200      // Hardware Request Status Channel 9
#define HRS8                          0x00000100      // Hardware Request Status Channel 8
#define HRS7                          0x00000080      // Hardware Request Status Channel 7
#define HRS6                          0x00000040      // Hardware Request Status Channel 6
#define HRS5                          0x00000020      // Hardware Request Status Channel 5
#define HRS4                          0x00000010      // Hardware Request Status Channel 4
#define HRS3                          0x00000008      // Hardware Request Status Channel 3
#define HRS2                          0x00000004      // Hardware Request Status Channel 2
#define HRS1                          0x00000002      // Hardware Request Status Channel 1
#define HRS0                          0x00000001      // Hardware Request Status Channel 0
#define HRS15-HRS0                    0x7FFF8000      // Hardware Request Status Channel 15-0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DCHPRIn register.
//
//*****************************************************************************

